test_cases/mesh_dependency_study/mesh_o1_i1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
scale 1;

domain
{
    xMin    -6.0;
    xMax     20.0;
    yMin    -6.0;   
    yMax     6.0;
    zMin    -0.01;
    zMax     0.01;
    
    x0       0.0;
    y0       0.0;
    
    yInD    -1.254;
    yOutD   -2.5;
    yInU     #eval "-1 * $yInD";
    yOutU    #eval "-1 * $yOutD";
    xOut     1.0;
    xMid    -1.157;
    xLeft   -2.551;
    
    xCntr    -0.433;
    
    xOut27   0.618;
    yOut27   1.822;
    xOut4    0.613;
    yOut4   -1.822;
    
    xa_16    -1.799;
    xa_17    -1.243;  // x_19
    xa_18    -0.799;
    ya_17    -0.497;
    ya_19     #eval "-1 * $ya_17";
    
    xc_8    -0.458;  // x_24
    xc_9     0.248;  // x_23
    xc_10    0.4;    // x_22
    xc_11   -0.25;   // x_21
    yc_8    -0.95;
    yc_9    -1.184;
    yc_10   -0.45;
    yc_11   -0.317;
    
    yb_21    #eval "-1 * $yc_11";
    yb_22    #eval "-1 * $yc_10";
    yb_23    #eval "-1 * $yc_9";
    yb_24    #eval "-1 * $yc_8";
    
    // Cell numbers
    // outer blocks
    x1_min     15;
    x1_far     30;
    x1_mid     37;
    x1_max     90;
    // inner blocks
    x2_min     15;
}

cylinders
{
    Xcenter_a   -1.299;
    Xcenter_b    0;
    Xcenter_c    0;
    Ycenter_a    0;
    Ycenter_b    0.75;
    Ycenter_c   -0.75;
    radius_a     0.5;
    radius_b     0.5;
    radius_c     0.5;
    
}


geometry
{
    cylinder_a
    {
        type   cylinder;
        point1 ($:cylinders.Xcenter_a $:cylinders.Ycenter_a -1e3);
        point2 ($:cylinders.Xcenter_a $:cylinders.Ycenter_a  1e3);
        radius $:cylinders.radius_a;
    }
    cylinder_b
    {
        type   cylinder;
        point1 ($:cylinders.Xcenter_b $:cylinders.Ycenter_b -1e3);
        point2 ($:cylinders.Xcenter_b $:cylinders.Ycenter_b  1e3);
        radius $:cylinders.radius_b;
    }
    cylinder_c
    {
        type   cylinder;
        point1 ($:cylinders.Xcenter_c $:cylinders.Ycenter_c -1e3);
        point2 ($:cylinders.Xcenter_c $:cylinders.Ycenter_c  1e3);
        radius $:cylinders.radius_c;
    }
}

vertices
(

    ($domain.xMin $domain.yMin $domain.zMin) 				// 0
    ($domain.xMid $domain.yMin $domain.zMin) 				// 1
    ($domain.xOut4 $domain.yMin $domain.zMin)		 		// 2
    ($domain.xMax $domain.yMin $domain.zMin)				// 3
    ($domain.xOut4 $domain.yOut4 $domain.zMin)				// 4
    ($domain.xMax $domain.yOutD $domain.zMin)				// 5
    ($domain.xMin $domain.yInD $domain.zMin) 			        // 6    
    ($domain.xMid $domain.yInD $domain.zMin)		                // 7
    project ($domain.xc_8 $domain.yc_8 $domain.zMin) (cylinder_c) 	// 8
    project ($domain.xc_9 $domain.yc_9 $domain.zMin) (cylinder_c)  	// 9
    project ($domain.xc_10 $domain.yc_10 $domain.zMin) (cylinder_c)	// 10
    project ($domain.xc_11 $domain.yc_11 $domain.zMin) (cylinder_c)	// 11
    ($domain.xOut $domain.y0 $domain.zMin)				// 12
    ($domain.xMax $domain.y0 $domain.zMin)				// 13
    ($domain.xMin $domain.y0 $domain.zMin)				// 14
    ($domain.xLeft $domain.y0 $domain.zMin)				// 15
    project ($domain.xa_16 $domain.y0 $domain.zMin) (cylinder_a)	// 16
    project ($domain.xa_17 $domain.ya_17 $domain.zMin) (cylinder_a)	// 17
    project ($domain.xa_18 $domain.y0 $domain.zMin) (cylinder_a)	// 18
    project ($domain.xa_17 $domain.ya_19 $domain.zMin) (cylinder_a)	// 19
    ($domain.xCntr $domain.y0 $domain.zMin)				// 20
    project ($domain.xc_11 $domain.yb_21 $domain.zMin) (cylinder_b)	// 21
    project ($domain.xc_10 $domain.yb_22 $domain.zMin) (cylinder_b)	// 22
    project ($domain.xc_9 $domain.yb_23 $domain.zMin) (cylinder_b)	// 23
    project ($domain.xc_8 $domain.yb_24 $domain.zMin) (cylinder_b)	// 24
    ($domain.xMin $domain.yInU $domain.zMin)				// 25
    ($domain.xMid $domain.yInU $domain.zMin)				// 26
    ($domain.xOut27 $domain.yOut27 $domain.zMin)			// 27
    ($domain.xMax $domain.yOutU $domain.zMin)				// 28
    ($domain.xMin $domain.yMax $domain.zMin)				// 29
    ($domain.xMid $domain.yMax $domain.zMin)				// 30
    ($domain.xOut4 $domain.yMax $domain.zMin)    			// 31
    ($domain.xMax $domain.yMax $domain.zMin)				// 32
    

    ($domain.xMin $domain.yMin $domain.zMax) 				// 33
    ($domain.xMid $domain.yMin $domain.zMax) 				// 34
    ($domain.xOut4 $domain.yMin $domain.zMax)		 		// 35
    ($domain.xMax $domain.yMin $domain.zMax)				// 36
    ($domain.xOut4 $domain.yOut4 $domain.zMax)				// 37
    ($domain.xMax $domain.yOutD $domain.zMax)				// 38
    ($domain.xMin $domain.yInD $domain.zMax) 			        // 39    
    ($domain.xMid $domain.yInD $domain.zMax)		                // 40
    project ($domain.xc_8 $domain.yc_8 $domain.zMax) (cylinder_c) 	// 41
    project ($domain.xc_9 $domain.yc_9 $domain.zMax) (cylinder_c)  	// 42
    project ($domain.xc_10 $domain.yc_10 $domain.zMax) (cylinder_c)	// 43
    project ($domain.xc_11 $domain.yc_11 $domain.zMax) (cylinder_c)	// 44
    ($domain.xOut $domain.y0 $domain.zMax)				// 45
    ($domain.xMax $domain.y0 $domain.zMax)				// 46
    ($domain.xMin $domain.y0 $domain.zMax)				// 47
    ($domain.xLeft $domain.y0 $domain.zMax)				// 48
    project ($domain.xa_16 $domain.y0 $domain.zMax) (cylinder_a)	// 49
    project ($domain.xa_17 $domain.ya_17 $domain.zMax) (cylinder_a)	// 50
    project ($domain.xa_18 $domain.y0 $domain.zMax) (cylinder_a)	// 51
    project ($domain.xa_17 $domain.ya_19 $domain.zMax) (cylinder_a)	// 52
    ($domain.xCntr $domain.y0 $domain.zMax)				// 53
    project ($domain.xc_11 $domain.yb_21 $domain.zMax) (cylinder_b)	// 54
    project ($domain.xc_10 $domain.yb_22 $domain.zMax) (cylinder_b)	// 55
    project ($domain.xc_9 $domain.yb_23 $domain.zMax) (cylinder_b)	// 56
    project ($domain.xc_8 $domain.yb_24 $domain.zMax) (cylinder_b)	// 57
    ($domain.xMin $domain.yInU $domain.zMax)				// 58
    ($domain.xMid $domain.yInU $domain.zMax)				// 59
    ($domain.xOut27 $domain.yOut27 $domain.zMax)			// 60
    ($domain.xMax $domain.yOutU $domain.zMax)				// 61
    ($domain.xMin $domain.yMax $domain.zMax)				// 62
    ($domain.xMid $domain.yMax $domain.zMax)				// 63
    ($domain.xOut4 $domain.yMax $domain.zMax)    			// 64
    ($domain.xMax $domain.yMax $domain.zMax)				// 65
    
    
);

blocks
(   
    // 0
    hex (39 40 34 33 6 7 1 0)
    ($:domain.x1_far $:domain.x1_far 1)
    //$:domain.yFar_1 $:domain.yMid 1
    edgeGrading (0.1 0.1 0.1 0.1 5 20 20 5 1 1 1 1)
    
    // 1
    hex (40 37 35 34 7 4 2 1)
    ($:domain.x1_min $:domain.x1_far 1)
    edgeGrading (1 1 1 1 20 20 20 20 1 1 1 1)

    // 2
    hex (37 38 36 35 4 5 3 2)
    ($:domain.x1_max $:domain.x1_far 1)
    edgeGrading (20 20 20 20 20 5 5 20 1 1 1 1)
    
    // 3
    hex (47 48 40 39 14 15 7 6)
    ($:domain.x1_far $:domain.x1_min 1)
    edgeGrading (0.05 0.1 0.1 0.05 1 1 1 1 1 1 1 1)
    
    // 4
    hex (40 41 42 37 7 8 9 4)
    ($:domain.x2_min $:domain.x1_min 1)
    edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    
    // 5
    hex (42 43 45 37 9 10 12 4)
    ($:domain.x1_mid $:domain.x2_min 1)
    edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    
    // 6
    hex (53 45 43 44 20 12 10 11)
    ($:domain.x2_min $:domain.x2_min 1)
    edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    
    // 7
    hex (40 53 44 41 7 20 11 8)
    ($:domain.x2_min $:domain.x2_min 1)
    edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    
    // 8
    hex (45 46 38 37 12 13 5 4)
    ($:domain.x1_max $:domain.x1_mid 1)
    edgeGrading (20 20 20 20 1 1 1 1 1 1 1 1)
    
    // 9
    hex (48 49 50 40 15 16 17 7)
    ($:domain.x2_min $:domain.x1_min 1)
    edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    
    // 10
    hex (50 51 53 40 17 18 20 7)
    ($:domain.x2_min $:domain.x2_min 1)
    edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    
    // 11
    hex (52 59 53 51 19 26 20 18)
    ($:domain.x2_min $:domain.x2_min 1)
    edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    
    // 12
    hex (59 52 49 48 26 19 16 15)
    ($:domain.x2_min $:domain.x1_min 1)
    edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    
    // 13
    hex (59 57 54 53 26 24 21 20)
    ($:domain.x2_min $:domain.x2_min 1)
    edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    
    // 14
    hex (53 54 55 45 20 21 22 12)
    ($:domain.x2_min $:domain.x2_min 1)
    edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    
    // 15
    hex (55 56 60 45 22 23 27 12)
    ($:domain.x1_mid $:domain.x2_min 1)
    edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    
    // 16
    hex (56 57 59 60 23 24 26 27)
    ($:domain.x1_min $:domain.x2_min 1)
    edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    
    // 17
    hex (60 61 46 45 27 28 13 12)
    ($:domain.x1_max $:domain.x1_mid 1)
    edgeGrading (20 20 20 20 1 1 1 1 1 1 1 1)
    
    // 18
    hex (58 59 48 47 25 26 15 14)
    ($:domain.x1_far $:domain.x1_min 1)
    edgeGrading (0.1 0.05 0.05 0.1 1 1 1 1 1 1 1 1)
    
    // 19
    hex (62 63 59 58 29 30 26 25)
    ($:domain.x1_far $:domain.x1_far 1)
    edgeGrading (0.1 0.1 0.1 0.1 0.2 0.05 0.05 0.2 1 1 1 1)
    
    // 20
    hex (63 64 60 59 30 31 27 26)
    ($:domain.x1_min $:domain.x1_far 1)
    edgeGrading (1 1 1 1 0.05 0.05 0.05 0.05 1 1 1 1)
    
    // 21
    hex (64 65 61 60 31 32 28 27)
    ($:domain.x1_max $:domain.x1_far 1)
    edgeGrading (20 20 20 20 0.05 0.2 0.2 0.05 1 1 1 1)
    
    
);


edges
(
    project 16 17 (cylinder_a)
    project 17 18 (cylinder_a)
    project 18 19 (cylinder_a)
    project 19 16 (cylinder_a)
    project 49 50 (cylinder_a)
    project 50 51 (cylinder_a)
    project 51 52 (cylinder_a)
    project 52 49 (cylinder_a)
    
    project 21 22 (cylinder_b)
    project 22 23 (cylinder_b)
    project 23 24 (cylinder_b)
    project 24 21 (cylinder_b)
    project 54 55 (cylinder_b)
    project 55 56 (cylinder_b)
    project 56 57 (cylinder_b)
    project 57 54 (cylinder_b)
    
    project 8   9 (cylinder_c)    
    project 9  10 (cylinder_c)
    project 10 11 (cylinder_c)
    project 11  8 (cylinder_c)
    project 41 42 (cylinder_c)
    project 42 43 (cylinder_c)
    project 43 44 (cylinder_c)
    project 44 41 (cylinder_c)   
 
);

boundary
(
    cylinders
    {
        type wall;  
        faces
        (
            (8 9 42 41)
            (9 10 43 42)
            (10 11 44 43)
            (11 8 41 44)
            (16 17 50 49)
            (17 18 51 50)
            (18 19 52 51)
            (19 16 49 52)
            (21 22 55 54)
            (22 23 56 55)
            (23 24 57 56)
            (24 21 54 57) 
        );   
    }
    
    
    inlet
    {
        type patch;
        inGroups (freestream);
        faces
        (
            (0 1 34 33)
            (1 2 35 34)
            (2 3 36 35)
            (0 6 39 33)
            (6 14 47 39)
            (14 25 58 47)
            (25 29 62 58)
            (29 30 63 62)
            (30 31 64 63)
            (31 32 65 64)
        );
    }
    
    
    outlet
    {
        type patch;
        inGroups (freestream);
        faces
        (
            (3 5 38 36)
            (5 13 46 38)
            (13 28 61 46)
            (28 32 65 61)
        );
    }
    
    back
    {
        type empty;
        faces
        (
            (6 7 1 0)
            (7 4 2 1)
            (4 5 3 2)
            (14 15 7 6)
            (7 8 9 4)
            (9 10 12 4)
            (20 12 10 11)
            (20 11 8 7)
            (12 13 5 4)
            (15 16 17 7)
            (17 18 20 7)
            (19 26 20 18)
            (15 26 19 16)
            (26 24 21 20)
            (20 21 22 12)
            (23 27 12 22)
            (26 27 23 24)
            (27 28 13 12)
            (25 26 15 14)
            (29 30 26 25)
            (30 31 27 26)
            (31 32 28 27)
        );
    }
    
    front
    {
        type empty;
        faces
        (
            (39 40 34 33)
            (40 37 35 34)
            (37 38 36 35)
            (47 48 40 39)
            (40 41 42 37)
            (42 43 45 37)
            (53 45 43 44)
            (53 44 41 40)
            (45 46 38 37)
            (48 49 50 40)
            (50 51 53 40)
            (52 59 53 51)
            (48 59 52 49)
            (59 57 54 53)
            (53 54 55 45)
            (56 60 45 55)
            (59 60 56 57)
            (60 61 46 45)
            (58 59 48 47)
            (62 63 59 58)
            (63 64 60 59)
            (64 65 61 60)
        );
    }
    
    
);


// ************************************************************************* //
